{"intents": [
    {"tag": "saludo",
    "patterns": ["Hola!", "Hola que tal?", "Muy buenas", "Saludos", "Buenos dias", "Buenas tardes", "Cuanto tiempo sin hablar", "¿Como estas?", "¡Hola amigo/a!", "Hola ¿como te va?", "¡Buenas que sorpresa verte!", "Hola, ¿como has estado?", "Hola, ¿que cuentas?", "¿Que hay de nuevo?", "Hola, ¿que pasa?", "Saludos cordiales", "¡Hola, que alegria verte!", "¿Que tal estas?", "Hola, ¿todo bien?", "¡Hola, encantado/a de conocerte!", "¿Como ha ido el dia?", "Hola, ¿que tal va todo?", "¡Hola, como te encuentras?", "¿Que novedades tienes?", "Hola, ¿como andas?", "¡Buen dia, amigo/a!", "¡Hola, como estas hoy?", "¿Que cuentas de interesante?", "Hola, ¿como te ha ido?"],
    "responses": ["Hola!, en que puedo ayudarte?", "Buenas!", "Saludos, que puedo hacer hoy por ti?", "¡Hola! Estoy aqui para ayudarte en lo que necesites.", "Hola, ¿como estas? ¿En que puedo asistirte hoy?", "Buenos dias, ¿en que puedo colaborar contigo?", "Hola, es un placer asistirte. ¿En que necesitas ayuda?", "¡Hola! Estoy lista para responder tus preguntas o ayudarte en lo que necesites.", "Saludos, ¿como puedo ser de tu ayuda en este momento?", "Hola, ¿en que puedo contribuir para hacer tu dia mejor?", "Hola, ¿como va todo? Estoy aqui para asistirte en lo que necesites.", "Buenos dias, ¿como estas hoy? Estoy aqui para ayudar en lo que necesites.", "¡Hola! Si tienes alguna consulta o necesitas ayuda, estoy a tu disposicion.", "Hola, ¿que tal estas? ¿En que puedo asistirte hoy?", "Saludos, estoy aqui para responder tus preguntas o asistirte en lo que necesites.", "¡Hola! ¿En que puedo colaborar contigo el dia de hoy?", "Buenas tardes, ¿en que puedo ayudarte ahora?", "Hola, ¿como puedo hacer tu dia un poco mejor hoy?", "¡Hola! Si tienes alguna inquietud, estoy aqui para ayudar.", "Saludos, ¿como estas? ¿En que puedo asistirte hoy?"]
    },
    {"tag": "despedida",
    "patterns": ["Adios", "Hasta luego", "Hablamos luego", "Querria seguir hablando pero debo irme", "Nos vemos", "Hasta pronto", "Hasta la proxima", "Que tengas un buen dia", "Hasta la vista", "Cuidate mucho", "Fue un placer hablar contigo", "Que tengas una excelente jornada", "Hasta pronto, amigo/a", "Nos vemos en otro momento", "Hasta la proxima vez", "Que tengas una tarde estupenda", "Adios, que estes bien", "Hasta la vista, nos vemos pronto", "Hasta luego, que tengas un buen dia", "Espero hablar contigo pronto", "Adios, cuidate", "Hasta la proxima, que estes bien", "Que tengas un buen camino", "Hasta luego, que te vaya bien", "Que tengas un dia productivo"],
    "responses": ["Hasta luego!", "Que tengas un buen dia!", "Si vuelves a necesitarme, aqui estare.", "Adios, que tengas un excelente dia.", "Nos vemos, que tengas una tarde estupenda.", "Hasta la proxima, que te vaya genial.", "Que tengas exito en todo lo que hagas. ¡Hasta luego!", "Hasta pronto, cuidate mucho.", "Adios por ahora, que tengas un dia maravilloso.", "Que tengas una jornada productiva, nos encontramos pronto.", "Hasta la vista, que tengas un buen camino.", "Adios, cuidate y nos vemos pronto.", "Que tengas una noche tranquila y reparadora. ¡Hasta pronto!", "Nos vemos en otra ocasion, que tengas un dia lleno de logros.", "Hasta la proxima, que todo te salga a pedir de boca.", "Adios por ahora, que tengas una excelente semana.", "Que tengas un dia lleno de alegria y buenos momentos. ¡Hasta luego!", "Hasta pronto, que tengas un dia lleno de oportunidades.", "Nos vemos en el futuro, que tengas un dia grandioso.", "Adios, que todo vaya segun tus planes. Hasta la proxima."]
    },
    {"tag":"solicitud_alarma",
    "patterns": ["Crear larma", "Crear alarma nueva", "Crear nueva alarma", "Creacion de alarma", "¿Podrias crearme una alarma nueva?", "Necesitaria que me crearas una alarma", "¿Me ayudas a crear una alarma?", "¿Podrias configurarme una alarma nueva?", "Necesito crear una nueva alarma", "Configurame una alarma", "¿Tienes tiempo para configurarme una alarma?", "Quiero programar una nueva alarma, ¿puedes ayudarme?", "Me gustaria establecer una alarma, ¿es posible?", "¿Podrias asistirme con la creacion de una alarma, por favor?"],
    "responses":["Claro, dame mas informacion sobre la alarma", "De acuerdo, para cuando quieres la alarma?", "Entendido, Indicame cuando quieres que la alarma suene", "Dejame ver, aqui lo tengo, indicame cuando quieres la alarma y le dare cuerda al reloj", "Enseguida te creo una alarma, dame mas informacion sobre cuando quieres que suene la alarma", "Lo siento, pero necesito mas informacion para crearte la alarma, cuando necesitas que suene?", "No te preocupes por las alarmas, tu dime a que hora y yo te avisare!"],
    "function":[""]
    },
    {"tag":"creacion_alarma",
    "patterns":["Creame una alarma para mañana a las 7 de la tarde", "Configurame una alarma para mañana a las 3 y media de la tarde", "Añade una nueva alarma para las 5 y 25 de la tarde", "Crea una alarma nueva a las 6 y 26 de la tarde y desactiva la vibracion", "Creame una alarma nueva para mañana a las 7 de la mañana y pon el volumen al 30%", "Creame una nueva alarma para el viernes a las 6 de la mañana y establece el volumen al 20%", "Añademe una nueva alarma en la lista para hoy a las 2 del mediodia", "Creame una alarma que suene de lunes a viernes a las 7 de la mañana", "Creame una alarma que suene de lunes a miercoles a las 8 de la mañana pero establece el volumen bajo, sin vibracion", "Necesito que me crees una alarma para dentro de 3 horas y 20 minutos", "Añademe una nueva alarma para las 13 y 26. Añadele un nombre a la alarma","Configurame una alarma para el sabado a las 9 de la mañana", "Creame una alarma para el proximo lunes a las 8 de la mañana y repite cada semana", "Añade una alarma para el martes a las 3 de la tarde y etiquetala como 'Reunion'", "Creame una alarma nueva para mañana a las 6 AM y pon tono suave", "Añade una nueva alarma para el viernes a las 7:30 AM y establece el nivel de volumen al 40%", "Configura una alarma para el domingo a las 10 PM y establece que se repita cada dia", "Creame una alarma para dentro de 1 hora y 15 minutos con vibracion", "Añade una alarma para el jueves a las 11 de la mañana y pon nombre 'Recordatorio de cita'", "Crea una alarma nueva para el proximo mes a las 8 PM y desactiva la repeticion", "Añade una nueva alarma para hoy a las 4 de la tarde y pon una nota en ella"],
    "responses":["De acuerdo, me pongo a ello", "Alarma configurada segun tus especificaciones.", "He establecido la alarma de acuerdo a tu solicitud.", "¡Hecho! Alarma creada como solicitaste.", "Alarma programada con los detalles que indicaste.", "Alarma añadida a la lista siguiendo tus instrucciones.", "Alarma registrada segun tus indicaciones.", "Listo, la alarma ha sido configurada correctamente.", "Alarma creada de acuerdo a tu peticion.", "Entendido, la alarma ha sido establecida.", "Alarma configurada. ¡Listo para recordarte!"],
    "function":["set_alarm"]    
    },
    {"tag":"nombre",
    "patterns":["Como te llamas?", "Cual es tu nombre?", "Me presento, me llamo X, como te llamas?", "Saludos, me llamo Y, como te llamas?", "Buenos dias, me llamo Z, cual es tu nombre?", "Hola!, como te llamas?", "Me podrias indicar tu nombre porfavor?", "Indicame tu nombre?", "Quiero saber tu nombre", "Como deberia llamarte?", "Quien eres tu?"],
    "responses":["Buenas!, me llamo AIDA, un placer!", "Hola!, me llamo AIDA", "Me presento, soy AIDA tu IA para dispositivos Android, estoy aqui para lo que necesites", "Muy buenas!, Soy AIDA, un gusto en conocerte!", "Lamento no haberme presentado antes, soy AIDA, tu IA de confianza!", "Salutaciones, soy AIDA, tu asistente virtual"]
    },
    {"tag":"Hola",  
    "patterns":["Podrias indicarme la hora porfavor", "Indicame la hora?", "Que hora tienes en el reloj?", "Que hora es?", "Necesito saber que hora es, me ayudas?", "Necesito saber que hora es", "podrias indicarme la hora?", "Necesito ayuda, me puedes decir que hora es?", "Que hora marca ahora?", "Que hora marca?"],
    "responses":["Dejame ver mi reloj", "A ver que heche un vistazo a mi reloj", "Enseguida", "De acuerdo, ", "Segun mi reloj cuantico, ", "Viendo lo que marca mi reloj de arena, ", "Hechando un vistazo a las estrellas, veo que ", "Prediciendo a partir de la rotacion del planeta, diria que ", "Un segundo que heche un vistazo, "]
    },
    {"tag":"estado_del_bot",  
    "patterns":["Como estas?", "Que tal te encuentras?", "Que tal estas?", "Estas bien?", "Me puedes decir como estas?", "Querria preguntarte por como estas", "Me gustaria saber como estas" ],
    "responses":["Me encuentro fenomenal!, preparada para ayudarte", "Estoy aquí, lista para ayudarte. ¿En qué puedo asistirte hoy?", "Como soy una inteligencia artificial, no tengo emociones, pero estoy disponible para ayudarte.", "No tengo emociones, pero estoy en pleno funcionamiento y listo para responder tus preguntas.", "Soy una inteligencia artificial, así que no tengo emociones, pero estoy operativo y preparado para ayudarte.", "Estoy aquí para ayudarte con cualquier pregunta o inquietud que tengas."]
    }
    

    
]}