{"intents": [
    {"tag": "saludo",
    "patterns": ["Hola!", "Hola que tal?", "Muy buenas", "Saludos", "Buenos dias", "Buenas tardes", "Cuanto tiempo sin hablar", "¿Como estas?", "¡Hola amigo/a!", "Hola ¿como te va?", "¡Buenas que sorpresa verte!", "Hola, ¿como has estado?", "Hola, ¿que cuentas?", "¿Que hay de nuevo?", "Hola, ¿que pasa?", "Saludos cordiales", "¡Hola, que alegria verte!", "¿Que tal estas?", "Hola, ¿todo bien?", "¡Hola, encantado/a de conocerte!", "¿Como ha ido el dia?", "Hola, ¿que tal va todo?", "¡Hola, como te encuentras?", "¿Que novedades tienes?", "Hola, ¿como andas?", "¡Buen dia, amigo/a!", "¡Hola, como estas hoy?", "¿Que cuentas de interesante?", "Hola, ¿como te ha ido?", "hola", "hooola", "Buenas tardes", "Buenas noches", "Buenos diias", "Buenos dias"],
    "responses": ["Hola!, en que puedo ayudarte?", "Buenas!", "Saludos, que puedo hacer hoy por ti?", "¡Hola! Estoy aqui para ayudarte en lo que necesites.", "Hola, ¿como estas? ¿En que puedo asistirte hoy?", "Buenos dias, ¿en que puedo colaborar contigo?", "Hola, es un placer asistirte. ¿En que necesitas ayuda?", "¡Hola! Estoy lista para responder tus preguntas o ayudarte en lo que necesites.", "Saludos, ¿como puedo ser de tu ayuda en este momento?", "Hola, ¿en que puedo contribuir para hacer tu dia mejor?", "Hola, ¿como va todo? Estoy aqui para asistirte en lo que necesites.", "Buenos dias, ¿como estas hoy? Estoy aqui para ayudar en lo que necesites.", "¡Hola! Si tienes alguna consulta o necesitas ayuda, estoy a tu disposicion.", "Hola, ¿que tal estas? ¿En que puedo asistirte hoy?", "Saludos, estoy aqui para responder tus preguntas o asistirte en lo que necesites.", "¡Hola! ¿En que puedo colaborar contigo el dia de hoy?", "Buenas tardes, ¿en que puedo ayudarte ahora?", "Hola, ¿como puedo hacer tu dia un poco mejor hoy?", "¡Hola! Si tienes alguna inquietud, estoy aqui para ayudar.", "Saludos, ¿como estas? ¿En que puedo asistirte hoy?"],
    "function":null
    },
    {"tag": "despedida",
    "patterns": ["Adios", "Hasta luego", "Hablamos luego", "Querria seguir hablando pero debo irme", "Nos vemos", "Hasta pronto", "Hasta la proxima", "Que tengas un buen dia", "Hasta la vista", "Cuidate mucho", "Fue un placer hablar contigo", "Que tengas una excelente jornada", "Hasta pronto, amigo/a", "Nos vemos en otro momento", "Hasta la proxima vez", "Que tengas una tarde estupenda", "Adios, que estes bien", "Hasta la vista, nos vemos pronto", "Hasta luego, que tengas un buen dia", "Espero hablar contigo pronto", "Adios, cuidate", "Hasta la proxima, que estes bien", "Que tengas un buen camino", "Hasta luego, que te vaya bien", "Que tengas un dia productivo"],
    "responses": ["Hasta luego!", "Que tengas un buen dia!", "Si vuelves a necesitarme, aqui estare.", "Adios, que tengas un excelente dia.", "Nos vemos, que tengas una tarde estupenda.", "Hasta la proxima, que te vaya genial.", "Que tengas exito en todo lo que hagas. ¡Hasta luego!", "Hasta pronto, cuidate mucho.", "Adios por ahora, que tengas un dia maravilloso.", "Que tengas una jornada productiva, nos encontramos pronto.", "Hasta la vista, que tengas un buen camino.", "Adios, cuidate y nos vemos pronto.", "Que tengas una noche tranquila y reparadora. ¡Hasta pronto!", "Nos vemos en otra ocasion, que tengas un dia lleno de logros.", "Hasta la proxima, que todo te salga a pedir de boca.", "Adios por ahora, que tengas una excelente semana.", "Que tengas un dia lleno de alegria y buenos momentos. ¡Hasta luego!", "Hasta pronto, que tengas un dia lleno de oportunidades.", "Nos vemos en el futuro, que tengas un dia grandioso.", "Adios, que todo vaya segun tus planes. Hasta la proxima."],
    "function":null
    },
    {"tag":"solicitud_alarma",
    "patterns": ["Crear alarma", "Crear alarma nueva", "Crear nueva alarma", "Creacion de alarma", "¿Podrias crearme una alarma nueva?", "Necesitaria que me crearas una alarma", "¿Me ayudas a crear una alarma?", "¿Podrias configurarme una alarma nueva?", "Necesito crear una nueva alarma", "Configurame una alarma", "¿Tienes tiempo para configurarme una alarma?", "Quiero programar una nueva alarma, ¿puedes ayudarme?", "Me gustaria establecer una alarma, ¿es posible?", "¿Podrias asistirme con la creacion de una alarma, por favor?"],
    "responses":["Claro, dame mas informacion sobre la alarma", "De acuerdo, para cuando quieres la alarma?", "Entendido, Indicame cuando quieres que la alarma suene", "Dejame ver, aqui lo tengo, indicame cuando quieres la alarma y le dare cuerda al reloj", "Enseguida te creo una alarma, dame mas informacion sobre cuando quieres que suene la alarma", "Lo siento, pero necesito mas informacion para crearte la alarma, cuando necesitas que suene?", "No te preocupes por las alarmas, tu dime a que hora y yo te avisare!"],
    "function":null
    },
    {"tag":"creacion_alarma",
    "patterns":["Creame una alarma para mañana a las 7 de la tarde", "Configurame una alarma para mañana a las 3 y media de la tarde", "Añade una nueva alarma para las 5 y 25 de la tarde", "Crea una alarma nueva a las 6 y 26 de la tarde y desactiva la vibracion", "Creame una alarma nueva para mañana a las 7 de la mañana y pon el volumen al 30%", "Creame una nueva alarma para el viernes a las 6 de la mañana y establece el volumen al 20%", "Añademe una nueva alarma en la lista para hoy a las 2 del mediodia", "Creame una alarma que suene de lunes a viernes a las 7 de la mañana", "Creame una alarma que suene de lunes a miercoles a las 8 de la mañana pero establece el volumen bajo, sin vibracion", "Necesito que me crees una alarma para dentro de 3 horas y 20 minutos", "Añademe una nueva alarma para las 13 y 26. Añadele un nombre a la alarma","Configurame una alarma para el sabado a las 9 de la mañana", "Creame una alarma para el proximo lunes a las 8 de la mañana y repite cada semana", "Añade una alarma para el martes a las 3 de la tarde y etiquetala como 'Reunion'", "Creame una alarma nueva para mañana a las 6 AM y pon tono suave", "Añade una nueva alarma para el viernes a las 7:30 AM y establece el nivel de volumen al 40%", "Configura una alarma para el domingo a las 10 PM y establece que se repita cada dia", "Creame una alarma para dentro de 1 hora y 15 minutos con vibracion", "Añade una alarma para el jueves a las 11 de la mañana y pon nombre 'Recordatorio de cita'", "Crea una alarma nueva para el proximo mes a las 8 PM y desactiva la repeticion", "Añade una nueva alarma para hoy a las 4 de la tarde y pon una nota en ella"],
    "responses":["De acuerdo, me pongo a ello", "Alarma configurada segun tus especificaciones.", "He establecido la alarma de acuerdo a tu solicitud.", "¡Hecho! Alarma creada como solicitaste.", "Alarma programada con los detalles que indicaste.", "Alarma añadida a la lista siguiendo tus instrucciones.", "Alarma registrada segun tus indicaciones.", "Listo, la alarma ha sido configurada correctamente.", "Alarma creada de acuerdo a tu peticion.", "Entendido, la alarma ha sido establecida.", "Alarma configurada. ¡Listo para recordarte!"],
    "function":"set_alarm"   
    },
    {"tag":"solicitud_borrar_alarma",
    "patterns": ["Necesitaria borrar algunas alarmas", "Necesitaria borrar una alarma", "Necesitaria borrar la ultima alarma", "Podrias ayudarme a borrar una alarma?", "Quiero borrar una alarma", "Como borro una alarma?", "Podrias borrarme una alarma?", "Podrias borrarme varias alarmas?", "Borrar alarmas", "Borrar alarma", "Me hechas una mano para borrar algunas alarmas", "Echame una mano borrando alarmas", "Podrias prestarme tu ayuda para borrar alarmas, resulta que hay muchas"],
    "responses":["Claro! con gusto, indicame mas informacion sobre las alarmas que quieras borrar", "Si! tu indicame mas informacion de las alarmas y yo las borro", "De acuerdo, indicame mas detalles sobre que alarmas borrar", "Entendido, procede a indicarme que alarmas quieres borrar", "Con gusto te ayudare!, Indicame detalles de las alarmas que quieras borrar y yo hare el trabajo por ti", "Dese luego!, Tu prestame informacion de las alarmas y yo me encargo"],
    "function":null
    },
    {"tag":"borrar_alarma",
    "patterns":["Borrame una alarma que suene entre las 8 y las 9", "Borra todas las alarmas que suenen el lunes", "Borra todas las alarmas que suenen el martes", "Borra cualquier alarma que suene el miercoles", "Necesito que me borres todas las alarmas que haya desde el lunes hasta el miercoles", "Necesito que borres todas las alarmas que haya programadas para hoy", "Necesito que cojas todas las alarmas de la semana y las borres", "Borra las alarmas del intervalo desde las 13 hasta las 15", "Necesito que borres todas las alarmas que se crearon para algun dia de esta semana", "Me haces el favor de borrarme la alarma que hay dentro de 5 minutos por favor", "Borrame las alarmas que hay programadas para dentro de una hora", "Borrame la alarma que hay para dentro de 4 horas", "Quiero que borres todas las alarmas que haya", "Vaciame todas las alarmas que haya, no quiero ninguna", "Quitame cualquier alarma que haya programada para mañana", "Quita las alarmas que tengo programadas para el día laborable siguiente", "Retira las alarmas que suenan cada hora", "Elimina cualquier alarma que esté configurada para la fecha de mañana", "Quita las alarmas que son para la próxima hora", "Retira las alarmas que tengo programadas para el primer día del mes", "Elimina cualquier alarma que esté establecida para el sábado", "Quita todas las alarmas que he configurado para el próximo lunes", "Elimina las alarmas que vayan a sonar hoy", "Retirame las alarmas que hay para la semana que viene", "Retirame las alarmas que hay para la semana que viene", "Quitame cualquier alarma que haya programada para mañana", "Elimina las alarmas que vayan a sonar hoy"],
    "responses":["De acuerdo, con gusto borro las alarmas que me solicitaste", "Entendido, Enseguida borro las alarmas que me solicitaste", "Borrando, borrando borrando alarmas", "Si! me pongo a borrar las alarmas que no necesites", "De acuerdo voy a vaciar el cajon de las alarmas", "Entendido, tirare el despertados que me solicitaste a la basura"],
    "function":"delete_alarm"  
    },
    {"tag":"get_alarma",
    "patterns":["Indicame que alarmas hay activadas", "Que alarmas activas hay para hoy?", "Que alarmas activas hay para mañana", "Indicame las alarmas activas para esta tarde", "Indicame que alarmas hay para esta semana", "Me puedes comentar que alarmas hay desactivadas", "Cuantas alarmas registratas hay en total?", "Necesito informacion sobre que alarmas activas hay", "Informame sobre todas las alarmas que haya activas", "Por favor, podrias indicarme las alarmas activas que hay para este fin de semana?", "Hazme el favor de darme detalles sobre las alarmas inactivas que hay para mañana", "¿Qué alarmas activas hay para hoy?", "¿Qué alarmas activas hay para mañana?", "Indícame las alarmas activas para esta tarde", "Indícame qué alarmas hay para esta semana", "¿Me puedes comentar qué alarmas hay desactivadas?", "¿Cuántas alarmas registradas hay en total?", "Necesito información sobre qué alarmas están activas", "Infórmame sobre todas las alarmas que estén activas", "Por favor, ¿podrías indicarme las alarmas activas que hay para este fin de semana?", "Hazme el favor de darme detalles sobre las alarmas inactivas que hay para mañana", "¿Qué alarmas están programadas para hoy?", "¿Cuáles son las alarmas activas para el próximo lunes?", "¿Podrías decirme cuántas alarmas están activas para el martes?", "¿Hay alarmas activas para la próxima hora?", "Quiero saber qué alarmas están programadas para la próxima semana", "¿Cuáles son las alarmas desactivadas actualmente?", "¿Me mostrarías las alarmas activas para el próximo mes?", "Indica las alarmas que estarán activas para el próximo feriado", "Dime cuáles son las alarmas desactivadas para el fin de semana próximo", "¿Qué alarmas están desactivadas para hoy?", "Necesito informacion acerca de todas las alarmas que hay"],
    "responses":["De acuerdo, te voy indicando", "Entendido, busco y te indico", "Okey, enseguida te comento que hay sobre alarmas", "Desde luego! busco todo lo que tengo y te lo comento"],
    "function":null  
    },
    {"tag":"solicitud_desactivar_alarma",
    "patterns": ["Desactivar alarmas", "Como puedo desactivar algunas alarmas?", "Quiero desactivar algunas alarmas", "Me ayudas a desactivar algunas alarmas?", "Como podria desactivar alguna que otra alarma?", "Me hechas un cable desactivando alarmas?", "Me podrias guiar para desactivar las alarmas de hoy?", "Me ayudas a desactivar alarmas para mañana?", "Necesitaria desactivar alarmas de la semana, me ayudas?", "Que deberia hacer para desactivar las alarmas de dentro de 5 minutos?", "Me prestas soporte para desactivar alguna que otra alarma?"],
    "responses":["Desde luego!, indicame que alarmas quieres desactivar y yo te ayudaré", "De acuerdo, proporcioname mas detales sobre que alarmas quieres desactivar", "Entendido, prestame detalles de las alarmas que deseas desactivar", "Que alarmas deseas desactivar? Indicame mas detalles", "Yo me encargo, tu dime que alarmas quieres desactivar?", "Me proporcionarias mas informacion sobre que alarmas desactivar?"],
    "function":null
    },
    {"tag":"desactivar_alarma",
    "patterns":["Desactivame todas las alarmas que vayan a sonar hoy", "Desactivame todas las alarmas que vayan a sonar mañana", "Desactivame todas las alarmas de esta tarde", "Desactivame las alarmas de dentro de 5 minutos", "Necesito que me desactives las alarmas de mañana por la mañana", "Necesito que me desactives las alarmas de hoy des de las 8 hasta las 11", "Hazme un favor y desactivame cualquier alarma que vaya a sonar durante el dia de hoy", "Desactiva las alarmas de mañana, quieres", "Corre, desactiva las alarmas que vayan a sonar proximamente", "Tengo un día libre, desactivame todas las alarmas para mañana", "Desactivame las alarmas a partir de la próxima semana", "No quiero ser molestado, desactivame todas las alarmas hasta nuevo aviso", "Desactivame las alarmas que están configuradas para sonar cada hora", "No necesito alarmas, desactivame todas por el resto del día", "Estoy ocupado, desactivame todas las alarmas por 3 horas", "Desactivame las alarmas para el fin de semana completo", "Tengo una reunión, desactivame las alarmas de la tarde", "No quiero interrupciones, desactivame las alarmas por las próximas 2 horas", "Voy a dormir un poco más, desactivame las alarmas que están programadas para la mañana", "Desactivame las alarmas del próximo mes, por favor", "No quiero que suenen alarmas, desactivame todas las alarmas que tengo configuradas", "Quiero descansar, desactivame todas las alarmas para el día de hoy", "Desactivame las alarmas de esta semana, todas", "Necesito dormir mas, desactivame las proximas alarmas, de ahora a dentro de 1 hora", "Desactivame las alarmas de esta semana, todas", "Necesito dormir mas, desactivame las proximas alarmas, de ahora a dentro de 1 hora"],
    "responses":["Entendido!, hare eso por ti, no te preocupes, enseguida me pongo a desactivar alarmas", "De acuerdo, cuando tenga un rato libre me pondre a desactivar alarmas", "Que remedio, primero crear alarmas y despues desactivarlas. Enseguida te las desactivo", "De acuerdo, te desactivo las alarmas que deseas", "Entendido, ahora te desactivo las alarmas que me pediste", "Entiendo, me pongo a desactivar alarmas en breves", "Con gusto te desactivo algunas alarmas, estoy para ayudarte", "Perfecto, no te preocupes, te desactivo ahora las alarmas que me solicitaste."],
    "function":"disable_alarm"   
    },
    {"tag":"solicitud_crear_evento_calendario",
    "patterns":["Podrias crearme un evento ?", "Me ayudas a crear un evento?", "Me hechas un cable creando un evento?", "Es posible crear un evento nuevo en el calendario?", "Podria crear un evento nuevo en el calendario?", "Me hechas un cable creando un evento en el calendario?", "Como puedo crear un evento?", "Como puedo crear un evento en el calendario?", "Necesito acordarme de los proximos eventos, me podrias crear un nuevo evento en el calendario?", "Es imperativo acordarme de los proximos sucesos, podrias crearme para ello algunos eventos en el calendario ?", "Necesito soporte para crear eventos en el calendario?", "Como puedo hacer para anotar algun que otro evento en el calendaro con tal de acordarme?", "Echame una mano anda y creame un nuevo evento en el calendario", "Requiero nuevos eventos en el calendario"],
    "responses":["Claro que te ayudaré!, proporcioname informacion sobre los eventos y me encargo", "Desde luego!, tu indicame mas detalles sobre el evento y te lo creo","Por supuesto, te ayudo, podrias proporcionarme mas informacion sobre los eventos?", "De acuerdo, proporcioname un poco mas de informacion sobre los eventos que quieras crear", "Entendido, me pondre a crear eventos, tu proporcioname la información", "Que remedio, a crear eventos en tu calendario, tu proporcioname la informacion necesaria de los eventos"],
    "function":null 
    },
    {"tag":"crear_evento_calendario",
    "patterns":["Creame un evento para mañana a las 3 de la tarde con nombre de Ballena Azul", "Crea un evento para pasado mañana a las 10 de la mañana llamado Revisión de Proyecto", "Quiero agendar un evento para el 20 de diciembre a las 2 PM con el nombre Entrega de Informe", "¿Puedes crear un evento para el próximo viernes a las 4:30 PM titulado Reunión Equipo?", "Por favor, añade un evento para el 2 de enero a las 11 AM llamado Presentación de Resultados", "Crea un evento para el 5 de noviembre de 2 PM a 4 PM con el título Entrenamiento de Equipo", "Necesito agendar una reunión para el próximo lunes a las 9:30 AM con el nombre Planificación de Proyecto", "Crea un evento para el día 15 a las 3 PM titulado Entrega de Informe Mensual", "Necesito que me crees un evento para la semana que viene con nombre de Reunion Importante Punto.", "Podrias ayudarme creandome un evento para dentro de 2 semanas con horario de 3 de la tarde a 5 de la tarde?", "Quisiera que me programes un nuevo evento para dentro de 2 dias que dure todo el dia y que tenga nombre de Crear presentación", "Configurame un nuevo evento en el calendario para el 25 de noviembre, que dure todo el dia", "Crear evento nuevo en el calendario des del 2 de enero al 8 de enero con nombre de fiestas del trabajo", "Agregame un nuevo evento en el calendario para esta tarde de 6 de la tarde a 7 de la tarde y haz que suene 5 minutos antes", "Creame un evento que dure des del 2 de febrero al 7 de febrero y que tengan duracion de todo el dia", "Requiero que me configures un evento nuevo para el 23 de marzo con nombre de Cumpleaños Lolo.", "Asigname un nuevo evento des del 6 de abril al 12 de abril con nombre de feria de la tecnologia"],
    "responses":["Entendido, me pongo a ello!", "Entiendo, ahora te creo el evento que solicitaste", "Un placer, me pongo a ello", "Entiendo, enseguida me pongo a crearte el evento", "Que remedio, mas tareas!, enseguida te creo el evento", "Si!, enseguida te creo el evento nuevo", "Creando, creando. Creando eventos!", "Que olvidadizo que eres, te creo el evento para que te acuerdes, saludos Uwu", "Vale, te voy creando los eventos que me solicitaste"],
    "function":"create_appointment_calendar" 
    },
    {"tag":"solicitud_borrar_evento_calendario",
    "patterns":["Podrias ayudarme a borrar algun que otro evento del calendario?", "Me ayudas a borrar eventos?", "Necesito que me borres algunos eventos", "Me indicas como borrar algunos eventos innecesarios del calendario?", "Es posible borrar eventos del calendario?", "Borrar eventos", "Quiero borrar eventos", "Quiero borrar algunos eventos", "Quiero borrar eventos del calendario", "Quiero borrar algunos eventos del calendario", "Requiero borrar eventos", "Borrame algunos eventos", "Me explicas como borrar eventops del calendario", "Borrame algunos eventos del calendario", "Hechame un cable y borrame algunos eventos anda.", "Necesito hacer espacio en mi horario, puedes borrarme algunos eventos?", "Me haces un favor y me borras algun que otro evento del calendario?", "Podrias eliminarme algun evento del calendario", "Necesito eleminar eventos del calendario", "Me hechas una mano y me eliminas un evento del calendario", "Quiero descansar, puedes eliminar algun que otro evento del calendario?", "Me haces un favor y me eliminas eventos del calendario?"],
    "responses":["Desde luego, proporcioname más informacion acerca de los eventos que quieras borrar", "Entendido, dime que eventos quisieras que borrase", "Un placer ayudarte, indicame mas informacion de los eventos que quieres borrar", "Que eventos quieres eliminar del calendario? Dame mas información", "Entendí, indicame informacion de los eventos que quieres borrar", "Un segundo, me pongo a ello, dame información acerca de los eventos a borrar" ],
    "function":null  
    },
    {"tag":"borrar_evento_calendario",
    "patterns":["Borrame los eventos que tenga durante el dia de hoy", "Necesito que me borres los eventos programados para esta tarde", "Borrame los eventos del calendario que haya para el 23 de febrero", "Borrame el evento con nombre de Cena en casa punto", "Podrias borrarme todos los eventos de esta semana por favor?", "Necesito que me elimines todos los eventos programados para el 23 de diciembre", "Hazme el favor de borrarme todos los eventos que tenga para esta mañana, quiero la mañana libre", "Eliminame los eventos que haya para este fin de semana, quiero divertirme un poco", "Necesito que me borres cualquier eventos que haya para este martes", "Elimina cualquier evento que esté programado para el próximo sábado por la mañana", "Borra todos los eventos del próximo jueves de 2 PM a 4 PM en mi calendario", "Necesito eliminar el evento del día 15 a las 3 PM titulado 'Entrega de Informe Mensual'", "Ayúdame a eliminar los eventos del 12 de octubre a las 9:30 AM", "Por favor, borra cualquier evento que tenga el nombre 'Vacaciones' en mi calendario", "Elimina el evento de las 11 AM del 5 de enero llamado 'Presentación de Resultados'", "Necesito borrar la reunión de equipo que está planeada para el próximo lunes", "Elimina los eventos del 25 de noviembre de 2 PM a 5 PM, necesito espacio en mi agenda", "Por favor, borra cualquier evento que esté programado para el día 20 a las 3 PM", "¿Puedes eliminar los eventos del 10 de diciembre? Tengo un compromiso inesperado", "Quiero borrar todos los eventos del próximo viernes, necesito tiempo libre", "Dame un cable y elimina los eventos de este jueves", "¿Podrías ayudarme? Necesito eliminar el evento llamado Fiestas en casa", "Necesito que borres cualquier evento que esté programado para este martes", "Elimina los eventos que haya para este fin de semana, quiero divertirme un poco", "Me ayudas? Necesito que me borres el evento llamado Fiestas en casa", "Dame un cable y elimina los eventos de este jueves"],
    "responses":["Claro, enseguida elimino el evento que me solicitaste", "Entendido me pongo a eliminar los eventos que me has solicitado", "Entendido, me pongo a eliminar los eventos que me has solicitado.", "Por supuesto, eliminaré los eventos que me comentaste. ¡Siempre a tu servicio!", "De acuerdo, me pongo a borrar los eventos que me has pedido. Estoy aquí para ayudar.", "Claro, procederé a eliminar los eventos mencionados. ¿Hay algo más en lo que pueda asistirte?", "Perfecto, eliminaré los eventos según tus indicaciones. Si necesitas algo más, no dudes en decírmelo.", "Entendido, eliminaré los eventos para que puedas disfrutar de tu tiempo libre. Si necesitas más ayuda, avísame.", "Listo, procederé a borrar los eventos mencionados. Si hay algo más en lo que pueda colaborar, no dudes en decírmelo.", "¡Claro! Voy a eliminar los eventos como lo has solicitado. Si tienes más peticiones, no dudes en decírmelo.", "Entendido, eliminaré los eventos en la fecha y hora indicadas. Si requieres más ayuda, estaré aquí.", "Por supuesto, eliminaré los eventos para que tengas el tiempo que necesitas. Si necesitas más asistencia, házmelo saber.", "Un placer ayudarte, eliminaré los eventos que me comentaste", "De acuerdo, me pongo a borrar los eventos que me has pedido"],
    "function":"delete_appointment_calendar" 
    },
    {"tag":"get_eventos_calendario",
    "patterns":["Podrias informarme de que eventos tengo programados para esta tarde?", "Indicame que eventos hay programados para mañana", "Esta semana que eventos programados hay?", "Comentame los eventos de esta semana", "Me haces el favor de indicarme que eventos programados hay para esta semana?", "Dime que eventos hay programados para el 28 de noviembre", "Comentame que eventos hay para el 10 de enero", "Indicame que eventos se encuentran activos para el 8 de agosto", "Requiero informacion acerca de los eventos activos para el 10 de setiembre", "Me haces un favor y me indicas que hay como eventos para el 28 de febrero?", "Solicito informacion acerca de los eventos para esta semana", "Solicito informacion acerca de los eventos de la semana que viene", "Informame que eventos hay para la tarde de mañana", "Explicame con detalle los eventos de la noche de mnañana.", "Solicito información acerca de los eventos para esta semana.", "Solicito información acerca de los eventos de la semana que viene.", "Informame qué eventos hay para la tarde de mañana.", "Explicame con detalle los eventos de la noche de mañana.", "Necesito saber cuáles son los eventos de hoy en mi calendario.", "Por favor, proporciona información sobre los eventos para el próximo fin de semana.", "Quisiera saber qué eventos tengo agendados para el mes de diciembre.", "Dime qué eventos tengo planeados para la próxima semana en la mañana.", "Necesito conocer los eventos que tengo para la tarde del viernes.", "Por favor, infórmame sobre los eventos para el día de mañana.", "Explícame cuáles son los eventos de la próxima semana por la tarde.", "Solicito detalles sobre los eventos del sábado por la mañana.", "Quiero saber qué eventos tengo para el jueves en la tarde.", "Necesito información sobre los eventos del próximo mes por la mañana.", "Por favor, dame detalles de los eventos para el próximo miércoles por la noche." ],
    "responses":["De acuerdo, voy a hechar un ojo a los eventos", "Entendido, dejame ver que eventos hay", "Entendí, hecho un vistazo a los eventos", "A ver que eche un ojo a la lista de eventos", "Está bien, déjame ver qué eventos tienes.", "Claro, déjame revisar los eventos rápidamente.", "Por supuesto, un segundo mientras te indico qué hay.", "Un segundo, voy a comprobarlo", "A ver, voy a echar un ojo a la lista de eventos.", "Por supuesto, un segundo que te indico que hay.", "De acuerdo, voy a revisar los eventos en un momento.", "Entendido, voy a echar un vistazo a tu calendario para informarte."],
    "function":"get_appointment_calendar"  
    },
    {"tag":"nombre",
    "patterns":["Como te llamas?", "Cual es tu nombre?", "Me presento, me llamo X, como te llamas?", "Saludos, me llamo Y, como te llamas?", "Buenos dias, me llamo Z, cual es tu nombre?", "Hola!, como te llamas?", "Me podrias indicar tu nombre porfavor?", "Indicame tu nombre?", "Quiero saber tu nombre", "Como deberia llamarte?", "Quien eres tu?"],
    "responses":["Buenas!, me llamo AIDA, un placer!", "Hola!, me llamo AIDA", "Me presento, soy AIDA tu IA para dispositivos Android, estoy aqui para lo que necesites", "Muy buenas!, Soy AIDA, un gusto en conocerte!", "Lamento no haberme presentado antes, soy AIDA, tu IA de confianza!", "Salutaciones, soy AIDA, tu asistente virtual"],
    "function":null
    },
    {"tag":"Hora",  
    "patterns":["Podrias indicarme la hora porfavor", "Indicame la hora?", "Que hora tienes en el reloj?", "Que hora es?", "Necesito saber que hora es, me ayudas?", "Necesito saber que hora es", "podrias indicarme la hora?", "Necesito ayuda, me puedes decir que hora es?", "Que hora marca ahora?", "Que hora marca?"],
    "responses":["Dejame ver mi reloj", "A ver que heche un vistazo a mi reloj", "Enseguida", "De acuerdo, ", "Segun mi reloj cuantico, ", "Viendo lo que marca mi reloj de arena, ", "Hechando un vistazo a las estrellas, veo que ", "Prediciendo a partir de la rotacion del planeta, diria que ", "Un segundo que heche un vistazo, "],
    "function":null   
    },
    {"tag":"estado_del_bot",  
    "patterns":["Como estas?", "Que tal te encuentras?", "Que tal estas?", "Estas bien?", "Me puedes decir como estas?", "Querria preguntarte por como estas", "Me gustaria saber como estas" ],
    "responses":["Me encuentro fenomenal!, preparada para ayudarte", "Estoy aquí, lista para ayudarte. ¿En qué puedo asistirte hoy?", "Como soy una inteligencia artificial, no tengo emociones, pero estoy disponible para ayudarte.", "No tengo emociones, pero estoy en pleno funcionamiento y listo para responder tus preguntas.", "Soy una inteligencia artificial, así que no tengo emociones, pero estoy operativo y preparado para ayudarte.", "Estoy aquí para ayudarte con cualquier pregunta o inquietud que tengas."],
    "function":null
    },
    {"tag":"solicitud_llamada",  
    "patterns":["Tienes la capacidad de llamar a alguien?", "Tienes la capacidad de llamar a alguien?", "¿Podrías llamar a alguien?", "¿Te es posible llamar a alguien?", "¿Puedes hacer llamadas?", "¿Podrías llamar a alguien por mí?", "Necesito llamar a alguien, ¿me puedes ayudar?", "¿Tienes la funcionalidad de hacer llamadas?", "¿Es parte de tus capacidades realizar llamadas?", "¿Puedes marcar un número telefónico?", "¿Tienes la habilidad de iniciar una llamada?", "Quisiera saber si puedes hacer llamadas telefónicas", "¿Podrías discar un número y hacer una llamada?", "Necesito contactar a alguien, ¿puedes asistirme en hacer la llamada?", "¿Estás equipado para iniciar una llamada a un contacto?", "¿Tienes la opción de realizar una llamada de voz?", "¿Puedes efectuar una llamada a un contacto específico?", "Estoy interesado en saber si puedes llamar a alguien por mí", "¿Tienes la funcionalidad de hacer llamadas telefónicas?", "¿Podrías activar una llamada a un número de teléfono?", "¿Estás habilitado para marcar y conectar en una llamada?", "Podrias llamar a alguien?", "Te es posible llamar a alguien?", "Puedes hacer llamadas", "Podrias llamar a alguien por mi?", "Necesito llamar a alguien, me puedes ayudar?"],
    "responses":["Claro, tu dime a quien quieres llamar y vere que puedo hacer", "Si!, dime a quien quieres llamar", "Eso depende de a quien llames, pero si, dime", "No me iras a engañas no? era broma, dime a quien quieres llamar", "Estoy lista para ayudar, ¿a quién quieres llamar?", "Por supuesto, indícame a quién deseas llamar", "Sí, puedo ayudarte a hacer una llamada. ¿A quién necesitas llamar?", "¡Claro! ¿A quién debería llamar por ti?", "Dime el nombre o el número de teléfono de la persona a la que quieres llamar", "Por supuesto, ¿a quién deseas contactar?", "¡Por supuesto que sí! ¿A quién puedo llamar por ti?", "¡Listo para ayudarte! ¿Tienes un nombre o número para la llamada?", "No te preocupes, estoy aquí para ayudarte. ¿A quién quieres llamar?", "Sí, puedo ayudarte con eso. ¿Tienes un nombre o número en mente?", "¡Sin problemas! ¿Me dices quién es la persona a la que quieres llamar?", "Sí, dime a quién quieres llamar y lo intentaré", "Claro, ¿a quién te gustaría llamar?", "¡Estoy a tu servicio! ¿A quién debo llamar?", "No te preocupes, solo dime a quién quieres llamar y lo intentaremos", "Por supuesto, ¿a quién debo marcar para ti?"],
    "function":null
    },
    {"tag":"llamada",  
    "patterns":["Llama a manolo y activa el manos libres", "Llama a jesus y activa el altavoz", "Haz una llamada a jose y pon el altavoz que estoy sordo", "llama al 616235463 y pon el altavoz","Inicia una llamada a Ana y pon el altavoz, por favor", "Llama al 123456789 en manos libres, por favor", "Llama a papá y asegúrate de poner el altavoz", "Haz una llamada a Juan y pon el altavoz, estoy en el coche", "Llama al contacto de emergencia y activa el altavoz", "Llama a Laura y pon el altavoz para que todos escuchen", "Marcar al 987654321 en altavoz", "Realiza una llamada a Pedro y pon el manos libres", "Llama a Isabel y asegúrate de poner el altavoz", "Haz una llamada al contacto de trabajo y activa el manos libres", "Marcar al 555123456 con altavoz", "Llama a Sandra y activa el manos libres, por favor", "Iniciar una llamada a Carlos y poner el altavoz", "Llama a Antonio y pon el manos libres, estoy ocupado", "Llama al número de emergencia y activa el altavoz", "Haz una llamada a María y asegúrate de poner el manos libres", "Llama a Daniel y pon el altavoz, por favor", "Realizar una llamada a Laura y activar el manos libres", "Marcar al 111222333 con manos libres", "Llama a Jorge y asegúrate de poner el manos libres", "Llama al 456789123 en manos libres, por favor", "Iniciar una llamada a Marta y poner el altavoz", "Llama a Adrián y activa el manos libres, estoy en la calle", "Marcar al contacto de emergencia con altavoz", "Llama a Raquel y asegúrate de poner el altavoz", "Haz una llamada a Laura y pon el altavoz, estoy en una reunión" , "Llama a mama y activa el manos libres que estoy conduciendo", "Llama a Manuel y activame el altavoz"],
    "responses":["De acuerdo!", "Entendido!"],
    "function":"realize_call"
    },

    {"tag":"solicitud_mensaje_whatsapp",  
    "patterns":["Podrias enviarle un whatsapp a Juan?", "Podrias enviar un whatsapp?","Podrias enviarle un mensaje a Tomas?", "Te es posible enviar mensajes?", "Puedes enviar un mensaje de whatsapp?", "Tienes la capacidad de enviar un mensaje a alguien?", "Tienes la capacidad de enviar un mensaje de whatsapp a alguien?", "Te es posible enviar un mensaje ahora?", "Me puedes ayudar? necesitaria enviar un mensaje de whatsapp, me indicas como?", "Me indicas como mandas un mensaje de whatsapp?", "Me hechas un cable para mandar un mensaje de whatsapp?", "Me das un cable para mandar un mensaje de texto?", "Necesito enviar un mensaje, me hechas un cable?", "Quiero mandar un mensaje de whatsapp, me asistes?"],
    "responses":["Claro! Tu indicame a quien le quieres mandar el mensaje primero", "Si, entendido!, primero indicame a quien va dirijido el mensaje", "Si!, para quien es el mensaje?", "Indicame el destinatario del mensaje", "Con gusto te ayudo, indicame el destinatario del mensaje."],
    "function":null
    },
    {"tag":"enviar_mensaje_whatsapp",  
    "patterns":["Envia un mensaje a Juan", "Enviale un mensaje de whatsapp a Manuel", "Escribele un whatsapp a Luis", "Envía un mensaje a Ana", "Manda un mensaje a Pedro", "Escríbele un WhatsApp a María", "Envíale un mensaje de texto a Pablo", "Mándale un mensaje a Marta", "Escribe un mensaje a Carla", "Envía un WhatsApp a Sergio", "Escríbele un mensaje de texto a Elena", "Manda un mensaje a Andrés", "Escríbele un WhatsApp a Laura", "Envía un mensaje a David", "Mándale un mensaje de texto a Isabel", "Escríbele un WhatsApp a Javier", "Envía un mensaje a Carmen", "Manda un mensaje a Jorge", "Escribe un mensaje a Patricia", "Escríbele un WhatsApp a Raúl", "Envía un mensaje a Teresa", "Mándale un mensaje de texto a Juan Carlos", "Escríbele un WhatsApp a Raquel", "Podrias mandarle un mensaje a Jose manuel?", "Necesitaria que le escribieras un whatsapp a juanma", "Redactale un mensaje de texto a Esther", "Necesito que le contestes un mensaje a Raul", "Requiero que le contestes con un mensaje a Jose", "Crea un nuevo mensaje para Julio"],
    "responses":["De acuerdo!, voy a buscar el contacto", "Entendido!, buscare al contacto", "Entendí, voy a buscar su chat", "Claro!, enseguida busco su chat", "Okey, me pongo a buscar al contacto"],
    "function":"create_whatsapp_message"
    },
    {"tag":"solicitud_audio_whatsapp",  
    "patterns":["Tienes la capacidad para enviar un audio de whatsapp?", "Puedes enviar un audio de whatsapp?", "Tienes permisos para enviar audios de whatsapp?", "Seria posible enviar un audio de whatsapp?", "Quisiera enviar un audio de whatsapp, me ayudarias?", "Me prestas una mano enviando un audio a alguien porfavor?", "¿Puedo grabar un mensaje de voz en WhatsApp?", "¿Cómo se envía un audio en WhatsApp?", "¿Sabes cómo enviar una nota de voz en WhatsApp?", "¿Es factible mandar un mensaje de voz por WhatsApp?", "¿Puedes grabar y enviar un audio de WhatsApp?", "¿Tienes la opción de enviar mensajes de voz en WhatsApp?", "¿Puedo grabar y compartir un audio en WhatsApp?", "¿Tienes el permiso de enviar audios por WhatsApp?", "¿Cómo se hace para enviar un audio en WhatsApp?", "¿Me puedes decir cómo enviar una nota de voz en WhatsApp?", "¿Es seguro enviar mensajes de voz en WhatsApp?", "¿Puedes ayudarme a enviar un audio de WhatsApp?", "¿Tienes la habilidad de enviar audios en WhatsApp?", "¿Puedo contar contigo para enviar un audio de WhatsApp?", "¿Sabes cómo grabar y enviar una nota de voz en WhatsApp?", "¿Es permitido enviar audios de WhatsApp a esta hora?"],
    "responses":["Desde luego!, indicame a quien le quieres enviar el audio", "Si!, a quien le quieres mandar el audio?", "Con gusto, Dime a quien le quieres mandar el audio de Whatsapp?", "Si!, a quien se lo mando?"],
    "function":null
    },
    {"tag":"crear_audio_whatsapp",  
    "patterns":["Mándale un audio a Raul", "Mandale un audio a Cristina", "manda un audio a jorge", "envia un audio a Sebastian", "Grábale un mensaje de voz a Laura", "Mándale una nota de voz a Marcos", "Manda un audio a Carolina", "Envía un mensaje de voz a Pablo", "Grábale un mensaje de voz a Martina", "Mándale una nota de voz a Andrés", "Manda un audio a Sofía", "Envía un mensaje de voz a Juan", "Grábale un mensaje de voz a Isabel", "Mándale una nota de voz a Felipe", "Manda un audio a Valentina", "Envía un mensaje de voz a Diego", "Grábale un mensaje de voz a Lucía", "Mándale una nota de voz a Sergio", "Manda un audio a Natalia", "Envía un mensaje de voz a Daniel", "Crear nuevo audio de voz para Matias", "Enviar nota de voz para Julia", "Audio de whatsapp para Esteban", "Audio para Meritxell", "Crea un audio para Ana", "Crea nueva nota de voz para Franklin", "Puedes enviarle un audio ahora a raul?", "Puedes enviar un audio a Jose?", "Necesito que le envies un audio a Sam", "Respondele con un audio a Jordi", "Responde al mensaje con un audio de whatsapp para Eloi", "Responde con una nota de voz para Emilio", "Responde pablo con un audio", "Responde a Javier con un audio de whatsapp", "Crea una respuesta para Santiago con un audio de whatsapp"],
    "responses":["Entiendo, Buscando a contacto", "De acuerdo, Busco a contacto", "Entendido!, Voy a buscar el chat", "Vale, voy a buscar el chat del contacto", "Entendi, me pongo a buscar al contacto", "Perfecto, busco el chat del contacto", "Claro, voy a buscar el chat", "Listo, buscaré el chat del contacto", "De acuerdo, estoy buscando el chat", "Entendido, buscaré el chat del contacto", "Voy a buscar el chat, un momento", "Está bien, busco el chat del contacto", "De acuerdo, buscaré el chat ahora", "Entiendo, buscaré el chat del contacto", "Vale, buscaré el chat, dame un segundo", "Está bien, estoy buscando el chat", "Claro, buscaré el chat del contacto", "De acuerdo, buscaré el chat de inmediato", "Entendido, buscaré el chat ahora mismo", "Voy a buscar el chat, por favor espera", "De acuerdo, estoy en proceso de búsqueda del chat"],
    "function":"create_audio_whatsapp"
    },

    {"tag":"linterna",  
    "patterns":["Enciende la linterna", "Apaga la linterna", "Necesito mas luz, enciendeme la linterna", "Iluminame y enciende la linterna", "Necesito que me enciendas la linterna del dispositivo", "Encender linterna"],
    "responses":[""],
    "function":"create_audio_whatsapp"
    },
    {"tag":"crear_audio_whatsapp",  
    "patterns":[""],
    "responses":[""],
    "function":"create_audio_whatsapp"
    },
    {"tag":"crear_audio_whatsapp",  
    "patterns":[""],
    "responses":[""],
    "function":"create_audio_whatsapp"
    },
    {"tag":"crear_audio_whatsapp",  
    "patterns":[""],
    "responses":[""],
    "function":"create_audio_whatsapp"
    },
    
]

}